[
    {
        "id": 1,
        "name": "The Silent Patient",
        "author": "Alex Michaelides",
        "image": "https://i.ibb.co/N3f8FyK/book-5.png",
        "review": "Fast-paced and filled with suspense, thrillers keep readers on the edge with unexpected twists and high-stakes tension. These books often involve dangerous situations, crimes, or espionage, where protagonists must navigate threats and challenges, making them ideal for readers who enjoy adrenaline-pumping, heart-racing narratives.",
        "totalPages": 336,
        "rating": 4.5,
        "category": "Thriller",
        "tags": ["suspense", "psychological"],
        "publisher": "Celadon Books",
        "yearOfPublishing": 2019
    },
    {
        "id": 2,
        "name": "Where the Crawdads Sing",
        "author": "Delia Owens",
        "image": "https://i.ibb.co/yXrDff4/book-6.png",
        "review": "Engaging whodunits where readers solve crimes alongside detectives, unraveling clues and uncovering secrets. Mysteries often involve a puzzling event, typically a murder or theft, and require astute observation and logical reasoning, making them perfect for those who love piecing together intricate plots and uncovering the truth.",
        "totalPages": 384,
        "rating": 4.8,
        "category": "Mystery",
        "tags": ["coming-of-age", "literary_fiction"],
        "publisher": "G.P. Putnam's Sons",
        "yearOfPublishing": 2018
    },
    {
        "id": 3,
        "name": "Educated",
        "author": "Tara Westover",
        "image": "https://i.ibb.co/rQBdG8y/book-7.png",
        "review": "Personal and reflective, memoirs offer intimate insights into the author's life, experiences, and emotions. These books provide a first-person account of significant events, challenges, and transformations, allowing readers to connect deeply with the author’s journey and gain understanding and empathy through shared human experiences.",
        "totalPages": 334,
        "rating": 4.7,
        "category": "Memoir",
        "tags": ["biography", "inspirational"],
        "publisher": "Random House",
        "yearOfPublishing": 2018
    },
    {
        "id": 4,
        "name": "Becoming",
        "author": "Michelle Obama",
        "image": "https://i.ibb.co/V3vfB9j/book-8.png",
        "review": "Blending history and fiction, these novels transport readers to past eras, bringing historical events and figures to life. By weaving factual details with imaginative storytelling, historical fiction offers a vivid and immersive experience, making history accessible and engaging for readers who enjoy exploring different time periods.",
        "totalPages": 448,
        "rating": 4.9,
        "category": "Memoir",
        "tags": ["biography", "political"],
        "publisher": "Crown Publishing Group",
        "yearOfPublishing": 2018
    },
    {
        "id": 5,
        "name": "The Book Thief",
        "author": "Markus Zusak",
        "image": "https://i.ibb.co/tQcmcQV/book-9.png",
        "review": " Informative and factual, non-fiction books educate readers on various topics, from science to self-help. These works aim to provide knowledge, insight, and understanding about real-world subjects, often written by experts, making them invaluable resources for lifelong learners and those seeking to expand their horizons",
        "totalPages": 552,
        "rating": 4.6,
        "category": "Historical Fiction",
        "tags": ["war", "literary_fiction"],
        "publisher": "Knopf Books for Young Readers",
        "yearOfPublishing": 2005
    },
    {
        "id": 6,
        "name": "A Brief History of Humankind",
        "author": "Yuval Noah Harari",
        "image": "https://i.ibb.co/5v2Zyfw/book-2.png",
        "review": "Set in oppressive futures, dystopian novels explore societal flaws through bleak and controlled worlds. These stories often depict totalitarian regimes, environmental disasters, or dehumanizing technologies, serving as cautionary tales that challenge readers to reflect on current issues and the potential consequences of societal and political trends.",
        "totalPages": 498,
        "rating": 4.7,
        "category": "Non-Fiction",
        "tags": ["history", "science"],
        "publisher": "Harper",
        "yearOfPublishing": 2015
    },
    {
        "id": 7,
        "name": "The Dating PlayBook",
        "author": "George Orwell",
        "image": "https://i.ibb.co/nQzmgSV/book-1.png",
        "review": "Timeless works of literature, classics offer enduring themes, memorable characters, and profound insights. These books have stood the test of time, influencing generations of readers and writers. They explore universal human experiences and moral dilemmas, making them essential reading for those seeking a deep and enriching literary experience.",
        "totalPages": 328,
        "rating": 4.8,
        "category": "Dystopian",
        "tags": ["political", "classic"],
        "publisher": "Secker & Warburg",
        "yearOfPublishing": 1949
    },
    {
        "id": 8,
        "name": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "image": "https://i.ibb.co/wc7pKQH/book-3.png",
        "review": "Character-driven and introspective, literary fiction delves deeply into human experiences and emotions. These novels prioritize complex character development and stylistic writing over plot, offering rich, nuanced narratives that explore existential themes, personal growth, and the intricacies of relationships, appealing to readers who appreciate thoughtful and contemplative stories.",
        "totalPages": 281,
        "rating": 4.9,
        "category": "Classic",
        "tags": ["social_justice", "historical_fiction"],
        "publisher": "J.B. Lippincott & Co.",
        "yearOfPublishing": 1960
    },
    {
        "id": 9,
        "name": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "image": "https://i.ibb.co/6sG6WYn/book-4.png",
        "review": "Imaginative and otherworldly, fantasy novels feature magical realms, mythical creatures, and epic adventures. These stories often involve quests, battles between good and evil, and richly detailed worlds, providing an escape into fantastical landscapes that captivate readers with their creativity and boundless possibilities.",
        "totalPages": 180,
        "rating": 4.3,
        "category": "Classic",
        "tags": ["romance", "literary_fiction"],
        "publisher": "Charles Scribner's Sons",
        "yearOfPublishing": 1925
    }
]
